Revit 2024 API
VendorIdAttribute Properties
The VendorIdAttribute type exposes the following members.
Properties
Name | Description
TypeId
When implemented in a derived class, gets a unique identifier for this Attribute.
 (Inherited from Attribute.)
Value
AddInId VendorId value.
See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace